Revit 2024 API
ParameterTypeId.StairsTrisertypeRiserStyle Property
 "Riser Type": (OBSOLETE)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsTrisertypeRiserStyle { get; }
Visual Basic
Public Shared ReadOnly Property StairsTrisertypeRiserStyle As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsTrisertypeRiserStyle {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace